---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen2
source: html/481e9c4d-2cb1-8aef-8f4e-63048c5ae8b1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen2 Property

"Alternating Bar - Start Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookTypen2 { get; }
```